; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-8-28)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p1-3 - location
	p4-0 - location
	p4-1 - location
	p4-3 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s4)
	(at driver3 s2)
	(at driver4 s2)
	(at driver5 s2)
	(at driver6 s4)
	(at driver7 s3)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s1)
	(empty truck6)
	(at truck7 s1)
	(empty truck7)
	(at truck8 s1)
	(empty truck8)
	(at package1 s2)
	(at package2 s3)
	(at package3 s0)
	(at package4 s2)
	(at package5 s3)
	(at package6 s3)
	(at package7 s4)
	(at package8 s0)
	(at package9 s2)
	(at package10 s0)
	(at package11 s2)
	(at package12 s4)
	(at package13 s2)
	(at package14 s2)
	(at package15 s4)
	(at package16 s4)
	(at package17 s2)
	(at package18 s1)
	(at package19 s4)
	(at package20 s3)
	(at package21 s1)
	(at package22 s3)
	(at package23 s2)
	(at package24 s2)
	(at package25 s0)
	(at package26 s2)
	(at package27 s1)
	(at package28 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s4)
	(link s4 s0)
	(link s2 s4)
	(link s4 s2)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s3)
	(at driver3 s2)
	(at driver7 s0)
	(at truck1 s1)
	(at truck3 s3)
	(at truck6 s3)
	(at truck7 s1)
	(at truck8 s3)
	(at package1 s3)
	(at package2 s2)
	(at package3 s2)
	(at package4 s1)
	(at package6 s0)
	(at package7 s3)
	(at package8 s4)
	(at package9 s0)
	(at package10 s1)
	(at package11 s4)
	(at package12 s2)
	(at package13 s2)
	(at package14 s0)
	(at package15 s4)
	(at package16 s2)
	(at package17 s2)
	(at package18 s2)
	(at package19 s0)
	(at package20 s0)
	(at package21 s2)
	(at package22 s2)
	(at package23 s0)
	(at package24 s3)
	(at package25 s2)
	(at package26 s2)
	(at package27 s4)
	(at package28 s0)
	))


)

; plan
1. (board-truck driver6 s4 truck2)
   deleted: (at driver6 s4) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 7 of 36
2. (drive-truck driver6 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 7 of 36
3. (drive-truck driver6 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 7 of 36
4. (load-truck s1 package27 truck2)
   deleted: (at package27 s1)
   added: (in package27 truck2)
   goals met: 7 of 36
5. (drive-truck driver6 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 7 of 36
6. (load-truck s0 package8 truck2)
   deleted: (at package8 s0)
   added: (in package8 truck2)
   goals met: 7 of 36
7. (drive-truck driver6 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 7 of 36
8. (unload-truck s4 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s4)
   goals met: 8 of 36
9. (load-truck s4 package7 truck2)
   deleted: (at package7 s4)
   added: (in package7 truck2)
   goals met: 8 of 36
10. (unload-truck s4 package27 truck2)
   deleted: (in package27 truck2)
   added: (at package27 s4)
   goals met: 9 of 36
11. (drive-truck driver6 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 9 of 36
12. (load-truck s0 package3 truck2)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   goals met: 9 of 36
13. (drive-truck driver6 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 9 of 36
14. (load-truck s2 package9 truck2)
   deleted: (at package9 s2)
   added: (in package9 truck2)
   goals met: 9 of 36
15. (load-truck s2 package4 truck2)
   deleted: (at package4 s2)
   added: (in package4 truck2)
   goals met: 9 of 36
16. (unload-truck s2 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   goals met: 10 of 36
17. (drive-truck driver6 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 10 of 36
18. (drive-truck driver6 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 10 of 36
19. (unload-truck s1 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   goals met: 11 of 36
20. (load-truck s1 package21 truck2)
   deleted: (at package21 s1)
   added: (in package21 truck2)
   goals met: 11 of 36
21. (drive-truck driver6 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 11 of 36
22. (drive-truck driver6 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 11 of 36
23. (load-truck s2 package24 truck2)
   deleted: (at package24 s2)
   added: (in package24 truck2)
   goals met: 11 of 36
24. (load-truck s2 package23 truck2)
   deleted: (at package23 s2)
   added: (in package23 truck2)
   goals met: 11 of 36
25. (drive-truck driver6 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 11 of 36
26. (unload-truck s0 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s0)
   goals met: 12 of 36
27. (drive-truck driver6 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 12 of 36
28. (load-truck s4 package19 truck2)
   deleted: (at package19 s4)
   added: (in package19 truck2)
   goals met: 12 of 36
29. (drive-truck driver6 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 12 of 36
30. (load-truck s0 package25 truck2)
   deleted: (at package25 s0)
   added: (in package25 truck2)
   goals met: 12 of 36
31. (drive-truck driver6 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 12 of 36
32. (unload-truck s2 package25 truck2)
   deleted: (in package25 truck2)
   added: (at package25 s2)
   goals met: 13 of 36
33. (unload-truck s2 package21 truck2)
   deleted: (in package21 truck2)
   added: (at package21 s2)
   goals met: 14 of 36
34. (drive-truck driver6 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 14 of 36
35. (unload-truck s0 package23 truck2)
   deleted: (in package23 truck2)
   added: (at package23 s0)
   goals met: 15 of 36
36. (drive-truck driver6 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 15 of 36
37. (drive-truck driver6 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 15 of 36
38. (unload-truck s3 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s3)
   goals met: 16 of 36
39. (load-truck s3 package6 truck2)
   deleted: (at package6 s3)
   added: (in package6 truck2)
   goals met: 16 of 36
40. (drive-truck driver6 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 16 of 36
41. (drive-truck driver6 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 16 of 36
42. (unload-truck s0 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   goals met: 17 of 36
43. (unload-truck s0 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s0)
   goals met: 18 of 36
44. (drive-truck driver6 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 18 of 36
45. (load-truck s1 package18 truck2)
   deleted: (at package18 s1)
   added: (in package18 truck2)
   goals met: 18 of 36
46. (drive-truck driver6 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 18 of 36
47. (drive-truck driver6 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 18 of 36
48. (unload-truck s2 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s2)
   goals met: 19 of 36
49. (load-truck s2 package14 truck2)
   deleted: (at package14 s2)
   added: (in package14 truck2)
   goals met: 19 of 36
50. (drive-truck driver6 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 19 of 36
51. (drive-truck driver6 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 19 of 36
52. (load-truck s3 package28 truck2)
   deleted: (at package28 s3)
   added: (in package28 truck2)
   goals met: 19 of 36
53. (drive-truck driver6 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 19 of 36
54. (load-truck s4 package16 truck2)
   deleted: (at package16 s4)
   added: (in package16 truck2)
   goals met: 19 of 36
55. (drive-truck driver6 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 19 of 36
56. (unload-truck s0 package28 truck2)
   deleted: (in package28 truck2)
   added: (at package28 s0)
   goals met: 20 of 36
57. (drive-truck driver6 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 20 of 36
58. (unload-truck s2 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s2)
   goals met: 21 of 36
59. (load-truck s2 package11 truck2)
   deleted: (at package11 s2)
   added: (in package11 truck2)
   goals met: 21 of 36
60. (drive-truck driver6 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 21 of 36
61. (drive-truck driver6 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 21 of 36
62. (load-truck s4 package12 truck2)
   deleted: (at package12 s4)
   added: (in package12 truck2)
   goals met: 21 of 36
63. (unload-truck s4 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s4)
   goals met: 22 of 36
64. (drive-truck driver6 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 22 of 36
65. (unload-truck s0 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s0)
   goals met: 23 of 36
66. (drive-truck driver6 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 23 of 36
67. (unload-truck s2 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s2)
   goals met: 24 of 36
68. (load-truck s2 package1 truck2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 24 of 36
69. (drive-truck driver6 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 24 of 36
70. (drive-truck driver6 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 24 of 36
71. (drive-truck driver6 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 24 of 36
72. (unload-truck s3 package24 truck2)
   deleted: (in package24 truck2)
   added: (at package24 s3)
   goals met: 25 of 36
73. (load-truck s3 package22 truck2)
   deleted: (at package22 s3)
   added: (in package22 truck2)
   goals met: 25 of 36
74. (load-truck s3 package20 truck2)
   deleted: (at package20 s3)
   added: (in package20 truck2)
   goals met: 25 of 36
75. (drive-truck driver6 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 25 of 36
76. (drive-truck driver6 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 25 of 36
77. (unload-truck s0 package20 truck2)
   deleted: (in package20 truck2)
   added: (at package20 s0)
   goals met: 26 of 36
78. (load-truck s0 package10 truck2)
   deleted: (at package10 s0)
   added: (in package10 truck2)
   goals met: 26 of 36
79. (drive-truck driver6 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 26 of 36
80. (unload-truck s1 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s1)
   goals met: 27 of 36
81. (board-truck driver2 s4 truck1)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 27 of 36
82. (drive-truck driver2 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 27 of 36
83. (load-truck s3 package2 truck1)
   deleted: (at package2 s3)
   added: (in package2 truck1)
   goals met: 27 of 36
84. (drive-truck driver2 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 27 of 36
85. (walk driver1 s3 p1-3)
   deleted: (at driver1 s3)
   added: (at driver1 p1-3)
   goals met: 27 of 36
86. (drive-truck driver6 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 27 of 36
87. (drive-truck driver6 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 27 of 36
88. (unload-truck s2 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s2)
   goals met: 28 of 36
89. (drive-truck driver6 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 28 of 36
90. (drive-truck driver6 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 28 of 36
91. (unload-truck s3 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   goals met: 29 of 36
92. (walk driver1 p1-3 s1)
   deleted: (at driver1 p1-3)
   added: (at driver1 s1)
   goals met: 30 of 36
93. (walk driver7 s3 p4-3)
   deleted: (at driver7 s3)
   added: (at driver7 p4-3)
   goals met: 30 of 36
94. (walk driver7 p4-3 s4)
   deleted: (at driver7 p4-3)
   added: (at driver7 s4)
   goals met: 30 of 36
95. (walk driver7 s4 p4-0)
   deleted: (at driver7 s4)
   added: (at driver7 p4-0)
   goals met: 30 of 36
96. (walk driver7 p4-0 s0)
   deleted: (at driver7 p4-0)
   added: (at driver7 s0)
   goals met: 31 of 36
97. (drive-truck driver2 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 31 of 36
98. (unload-truck s2 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   goals met: 32 of 36
99. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 32 of 36
100. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 33 of 36
101. (disembark-truck driver2 s1 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 33 of 36
102. (board-truck driver1 s1 truck6)
   deleted: (at driver1 s1) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 32 of 36
103. (board-truck driver2 s1 truck8)
   deleted: (at driver2 s1) (empty truck8)
   added: (driving driver2 truck8)
   goals met: 32 of 36
104. (drive-truck driver2 s1 s0 truck8)
   deleted: (at truck8 s1)
   added: (at truck8 s0)
   goals met: 32 of 36
105. (drive-truck driver2 s0 s4 truck8)
   deleted: (at truck8 s0)
   added: (at truck8 s4)
   goals met: 32 of 36
106. (drive-truck driver2 s4 s3 truck8)
   deleted: (at truck8 s4)
   added: (at truck8 s3)
   goals met: 33 of 36
107. (disembark-truck driver2 s3 truck8)
   deleted: (driving driver2 truck8)
   added: (at driver2 s3) (empty truck8)
   goals met: 34 of 36
108. (drive-truck driver1 s1 s0 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s0)
   goals met: 34 of 36
109. (drive-truck driver1 s0 s4 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s4)
   goals met: 34 of 36
110. (drive-truck driver1 s4 s3 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s3)
   goals met: 35 of 36
111. (disembark-truck driver1 s3 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s3) (empty truck6)
   goals met: 35 of 36
112. (walk driver1 s3 p1-3)
   deleted: (at driver1 s3)
   added: (at driver1 p1-3)
   goals met: 35 of 36
113. (walk driver1 p1-3 s1)
   deleted: (at driver1 p1-3)
   added: (at driver1 s1)
   goals met: 36 of 36
